Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.GetAllTemporaryColored Method
 Gets all temporary colored objects and their color
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static IEnumerable<KeyValuePair<Identifier, Color>> GetAllTemporaryColored()
Public Shared Function GetAllTemporaryColored As IEnumerable(Of KeyValuePair(Of Identifier, Color))
Return Value
Type: IEnumerable<KeyValuePair<Identifier, Color>>
Enumerable of Identifier-Color pairs
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace